# A/B Testing

## Test of Means Analysis
Statistical calculation of whether the mean values of the treatment and control groups are the same

## T-Test
Give p-value - likelihood the actual difference between the means is zero.  
p-value < 0.05 (statistically significant)  
T-test is important when working in small data set

There are three types of t-tests you can use:  
1. Paired  
2. Equal variance  
3. Unequal variance  

In a random experiment you will usually assume that variances between the groups are different, so weâ€™ll use an unequal variance t-test.

In [1]:
# load package
import pandas as pd
from scipy.stats import ttest_ind

## Supper Hero Data

In [2]:
super_hero = pd.read_excel('superherodata.xlsx')
super_hero

,Name,Alignment,Intelligence,Strength,Speed,Durability,Power,Combat,Unnamed: 8,Hero,Rival,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,Iron Man,good,100.000000,85.000000,58.000000,85.000000,100.000000,64.000000,NaN,Iron Man,Ultron,NaN,NaN,NaN,NaN
1,Captain America,good,63.000000,65.000000,35.000000,56.000000,46.000000,100.000000,NaN,Captain America,Red Skull,NaN,NaN,NaN,NaN
2,Hulk,good,88.000000,100.000000,47.000000,100.000000,41.000000,85.000000,NaN,Hulk,Abomination,NaN,NaN,NaN,NaN
3,Hawkeye,good,62.000000,12.000000,23.000000,14.000000,26.000000,80.000000,NaN,Hawkeye,Bullseye,NaN,NaN,NaN,NaN
4,Thor,good,69.000000,100.000000,92.000000,100.000000,100.000000,85.000000,NaN,Thor,Loki,NaN,NaN,NaN,NaN
5,Spider-Man,good,88.000000,55.000000,60.000000,74.000000,58.000000,85.000000,NaN,Spider-Man,Green Goblin,NaN,NaN,NaN,NaN
6,Average,NaN,78.333333,69.500000,52.500000,71.500000,61.833333,83.166667,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Ultron,bad,95.000000,83.000000,42.000000,100.000000,100.000000,64.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,Red Skull,bad,90.000000,30.000000,12.000000,14.000000,19.000000,80.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,Abomination,bad,85.000000,80.000000,53.000000,90.000000,55.000000,95.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,Bullseye,bad,75.000000,11.000000,25.000000,70.000000,20.000000,70.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,Loki,bad,87.000000,57.000000,47.000000,85.000000,85.000000,56.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,Green Goblin,bad,85.000000,35.000000,35.000000,48.000000,38.000000,28.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,86.166667,49.333333,35.666667,67.833333,52.833333,65.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,0.100000,-0.290168,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,0.300942,0.291602,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
useful_columns = list(super_hero.columns)[:8]
useful_columns

['Name',
 'Alignment',
 'Intelligence',
 'Strength',
 'Speed',
 'Durability',
 'Power',
 'Combat']

In [4]:
super_hero_clean_data = super_hero[useful_columns].dropna()
super_hero_clean_data

,Name,Alignment,Intelligence,Strength,Speed,Durability,Power,Combat
0,Iron Man,good,100.0,85.0,58.0,85.0,100.0,64.0
1,Captain America,good,63.0,65.0,35.0,56.0,46.0,100.0
2,Hulk,good,88.0,100.0,47.0,100.0,41.0,85.0
3,Hawkeye,good,62.0,12.0,23.0,14.0,26.0,80.0
4,Thor,good,69.0,100.0,92.0,100.0,100.0,85.0
5,Spider-Man,good,88.0,55.0,60.0,74.0,58.0,85.0
8,Ultron,bad,95.0,83.0,42.0,100.0,100.0,64.0
9,Red Skull,bad,90.0,30.0,12.0,14.0,19.0,80.0
10,Abomination,bad,85.0,80.0,53.0,90.0,55.0,95.0
11,Bullseye,bad,75.0,11.0,25.0,70.0,20.0,70.0
12,Loki,bad,87.0,57.0,47.0,85.0,85.0,56.0
13,Green Goblin,bad,85.0,35.0,35.0,48.0,38.0,28.0

In [5]:
good = super_hero_clean_data[super_hero_clean_data['Alignment']=='good'].select_dtypes(exclude='O')
good

   Intelligence  Strength  Speed  Durability  Power  Combat
0         100.0      85.0   58.0        85.0  100.0    64.0
1          63.0      65.0   35.0        56.0   46.0   100.0
2          88.0     100.0   47.0       100.0   41.0    85.0
3          62.0      12.0   23.0        14.0   26.0    80.0
4          69.0     100.0   92.0       100.0  100.0    85.0
5          88.0      55.0   60.0        74.0   58.0    85.0

In [6]:
bad = super_hero_clean_data[super_hero_clean_data['Alignment']=='bad'].select_dtypes(exclude='O')
bad

    Intelligence  Strength  Speed  Durability  Power  Combat
8           95.0      83.0   42.0       100.0  100.0    64.0
9           90.0      30.0   12.0        14.0   19.0    80.0
10          85.0      80.0   53.0        90.0   55.0    95.0
11          75.0      11.0   25.0        70.0   20.0    70.0
12          87.0      57.0   47.0        85.0   85.0    56.0
13          85.0      35.0   35.0        48.0   38.0    28.0

In [7]:
sp = ttest_ind(good, bad, equal_var=False)
print('Statistic:', sp.statistic)
print('pvalue:', sp.pvalue)

Statistic: [-1.12050955  1.11471746  1.45838682  0.19621283  0.47871287  1.69207353]
pvalue: [0.30094185 0.2916016  0.18086733 0.84837569 0.64249665 0.13204121]

## Customer Support Time Study Data

In [8]:
customer_data = pd.read_excel('customersupporttimestudydata.xlsx', header=2)
customer_data

,Customer Onboarding Process,Employee 1,Employee 2,Employee 3,Employee 4,Employee 5,Employee 6,Employee 7,Employee 8,Employee 9,Employee 10
0,Identify Key Customer Contacts,1.82,2.89,3.75,1.5,3.59,3.24,1.33,2.48,2.52,3.98
1,Assign Customer Support Resources,0.86,0.44,0.78,0.73,0.51,0.65,0.67,0.67,0.89,0.36
2,Enter Customer Information into Database,1.48,1.98,1.59,1.34,1.03,1.58,1.33,1.86,1.18,1.67
3,Establish Success Metrics,10.9,10.12,9.79,11.53,11.03,9.77,10.37,10.89,10.71,10.26
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,Joe,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Customer Onboarding Process,Employee 1,Employee 2,Employee 3,Employee 4,Employee 5,Employee 6,Employee 7,Employee 8,Employee 9,Employee 10
9,Identify Key Customer Contacts,4.44,4.83,2.85,4.34,4.46,3,3.27,4.51,2.2,4.74
10,Assign Customer Support Resources,0.65,0.59,0.34,0.01,0.64,0.01,0.11,0.14,0.04,0.54
11,Enter Customer Information into Database,2.17,1.79,1.84,1.69,2.02,1.65,1.46,1.65,2.06,1.55
12,Establish Success Metrics,12.27,10.2,9.27,9.79,9.89,10.68,12.21,9.91,12.95,10.15

In [9]:
customer_data = customer_data.dropna().drop(index=8).drop(columns='Customer Onboarding Process').astype('float')
customer_data

,Employee 1,Employee 2,Employee 3,Employee 4,Employee 5,Employee 6,Employee 7,Employee 8,Employee 9,Employee 10
0,1.82,2.89,3.75,1.50,3.59,3.24,1.33,2.48,2.52,3.98
1,0.86,0.44,0.78,0.73,0.51,0.65,0.67,0.67,0.89,0.36
2,1.48,1.98,1.59,1.34,1.03,1.58,1.33,1.86,1.18,1.67
3,10.90,10.12,9.79,11.53,11.03,9.77,10.37,10.89,10.71,10.26
9,4.44,4.83,2.85,4.34,4.46,3.00,3.27,4.51,2.20,4.74
10,0.65,0.59,0.34,0.01,0.64,0.01,0.11,0.14,0.04,0.54
11,2.17,1.79,1.84,1.69,2.02,1.65,1.46,1.65,2.06,1.55
12,12.27,10.20,9.27,9.79,9.89,10.68,12.21,9.91,12.95,10.15

In [10]:
nataly = customer_data[:4].sum().values
joe = customer_data[4:].sum().values
joe

array([19.53, 17.41, 14.3 , 15.83, 17.01, 15.34, 17.05, 16.21, 17.25,
       16.98])

In [11]:
sp = ttest_ind(joe, nataly, equal_var=False)
print('Statistic:', sp.statistic)
print('pvalue:', sp.pvalue)

Statistic: 2.5569719803766966
pvalue: 0.02312427188943783

## Customer Service AB Testing Data

In [12]:
customer_service_data = pd.read_csv('customerserviceabtestdata.csv')
customer_service_data.head()

   RecordID    Phone Number  AutomatedFlag  CS Rating
0         1  (733) 308-5171              1          2
1         2  (737) 479-9819              0          5
2         3  (571) 837-6630              0          4
3         4  (746) 481-2200              0          5
4         5  (224) 126-2105              1          4

In [13]:
phone_count = customer_service_data['Phone Number'].value_counts()
phone_count[:10]

(131) 231-3793    2
(197) 709-4054    2
(197) 374-6775    2
(561) 682-8993    2
(571) 837-6630    2
(546) 286-7815    2
(494) 893-3812    2
(257) 998-4039    2
(395) 540-9403    1
(229) 646-8659    1
Name: Phone Number, dtype: int64

In [14]:
AutomatedFlag_0 = customer_service_data[customer_service_data['AutomatedFlag']==0]['CS Rating'].values
AutomatedFlag_1 = customer_service_data[customer_service_data['AutomatedFlag']==1]['CS Rating'].values
AutomatedFlag_1

array([2, 4, 2, 4, 1, 4, 3, 5, 2, 4, 4, 3, 4, 4, 3, 1, 5, 4, 4, 5, 4, 4,
       5, 5, 3, 5, 5, 2, 5, 3, 5, 3, 1, 2, 4, 5, 4, 2, 5, 2, 4, 4, 2, 1,
       2, 5, 3, 4, 3, 4, 4, 2, 2, 3, 1, 5, 5, 3, 3, 4, 2, 2, 3, 3, 5, 5,
       3, 4, 4, 1, 3, 5, 2, 1, 3, 5, 3, 5, 5, 3, 1, 2, 3, 3, 3, 1, 5, 5,
       4, 1, 3, 5, 4, 3, 5, 4, 3, 5, 1, 5, 3, 1, 4, 4, 4, 1, 5, 2, 4, 4,
       5, 4, 4, 5, 5, 4, 1, 1, 3, 1, 4, 2, 1, 1, 4, 4, 5, 2, 4, 3, 4, 2,
       4, 1, 4, 2, 5, 2, 4, 1, 4, 5, 5, 3, 1, 1, 1, 3, 2, 5, 2, 4, 5, 5,
       1, 1, 3, 3, 1, 4, 3, 5, 2, 2, 5, 5, 4, 3, 5, 5, 3, 4, 1, 3, 4, 2,
       3, 3, 4, 2, 5, 3, 2, 2, 1, 2, 2, 2, 5, 2, 4, 2, 4, 2, 3, 3, 4, 3,
       1, 2, 4, 3, 5, 5, 4, 4, 5, 1, 5, 5, 4, 5, 1, 4, 3, 2, 5, 3, 5, 4,
       2, 3, 1, 4, 5, 4, 2, 2, 3, 2, 2, 5, 5, 4, 4, 2, 1, 5, 5, 5, 1, 1,
       2, 3, 5, 4, 1], dtype=int64)

In [15]:
sp = ttest_ind(AutomatedFlag_0, AutomatedFlag_1, equal_var=False)
print('Statistic:', sp.statistic)
print('pvalue:', sp.pvalue)

Statistic: -1.9194225278771027
pvalue: 0.0555978861900951

## Grocery Website AB Test Data

In [16]:
data = pd.read_csv('grocerywebsiteabtestdata.csv')
data.head()

   RecordID   IP Address  LoggedInFlag  ServerID  VisitPageFlag
0         1  39.13.114.2             1         2              0
1         2    13.3.25.8             1         1              0
2         3  247.8.211.8             1         1              0
3         4  124.8.220.3             0         3              0
4         5  60.10.192.7             0         2              0